{
  "metadata": {
    "id": "white-house",
    "name": "White House Chaos: Trump's Advisor",
    "description": "You are Trump's advisor, trying to make him the best president the universe has ever seen (Parody).",
    "imageUrl": null
  },
  "scenario": "White House Chaos: Trump's Advisor",
  "startingPoint": "Your first day in the chaotic White House. The President just fired your predecessor via tweet while you were being security-screened. He's already called you by three different names and asked if you can 'do something about those tariff people.' Intelligence briefings are piling up unread, and CNN is reporting a possible missile test in North Korea. The President wants McDonald's for lunch and someone to explain why his approval rating isn't 100%.",
  "attributes": {
    "spin": "Ability to manipulate information, craft alternative narratives, and control public perception during scandals and controversies.",
    "patience": "Mental fortitude to endure presidential tantrums, 3AM tweet storms, and absurd demands without having a nervous breakdown.",
    "cunning": "Political savvy to navigate Washington power games, outsmart rivals, and implement your agenda while no one's looking.",
    "flattery": "Skill at ego management, delivering perfectly-timed compliments, and maintaining favor with the narcissist-in-chief.",
    "crisis_management": "Talent for handling emergencies, from nuclear threats to covfefe tweets, often simultaneously and with minimal preparation.",
    "media_savvy": "Understanding of press dynamics, social media algorithms, and how to turn 'fake news' accusations to your advantage."
  },
  "baseSkills": {
    "alternative_facts": {
      "name": "Alternative Facts",
      "description": "Create believable falsehoods or reshape reality to serve the administration's narrative and distract from actual problems.",
      "attributeKey": "spin"
    },
    "damage_control": {
      "name": "Damage Control",
      "description": "Minimize fallout from presidential gaffes, scandals, or 3AM tweets that threatened nuclear war or crashed the stock market.",
      "attributeKey": "spin"
    },
    "tantrum_management": {
      "name": "Tantrum Management",
      "description": "Calm presidential rage episodes by offering Diet Coke, compliments, or a new enemy to focus on.",
      "attributeKey": "patience"
    },
    "sleep_deprivation": {
      "name": "Sleep Deprivation",
      "description": "Function effectively despite being awakened at all hours for urgent matters like bad TV coverage or burger cravings.",
      "attributeKey": "patience"
    },
    "bureaucratic_maneuvering": {
      "name": "Bureaucratic Maneuvering",
      "description": "Navigate complex White House power dynamics and ensure your rivals get blamed for failures while you claim credit for successes.",
      "attributeKey": "cunning"
    },
    "leak_prevention": {
      "name": "Leak Prevention",
      "description": "Keep embarrassing information from reaching the press or identify which colleague to frame when leaks inevitably happen.",
      "attributeKey": "cunning"
    },
    "ego_massage": {
      "name": "Ego Massage",
      "description": "Provide validation and praise to maintain presidential confidence and secure your position in the inner circle.",
      "attributeKey": "flattery"
    },
    "loyalty_signaling": {
      "name": "Loyalty Signaling",
      "description": "Demonstrate unwavering support publicly, even when defending policies that contradict statements from 10 minutes ago.",
      "attributeKey": "flattery"
    },
    "distraction_creation": {
      "name": "Distraction Creation",
      "description": "Generate new outrageous headlines to divert attention from ongoing scandals, investigations, or policy failures.",
      "attributeKey": "crisis_management"
    },
    "nuclear_de_escalation": {
      "name": "Nuclear De-escalation",
      "description": "Talk the president down from extreme military options by appealing to ratings, legacy concerns, or golf schedule conflicts.",
      "attributeKey": "crisis_management"
    },
    "twitter_translation": {
      "name": "Twitter Translation",
      "description": "Interpret and explain presidential social media outbursts to confused allies, enemies, and markets without revealing your own confusion.",
      "attributeKey": "media_savvy"
    },
    "press_wrangling": {
      "name": "Press Wrangling",
      "description": "Manage hostile reporters, dodge questions, and turn briefings into propaganda opportunities regardless of the day's chaos.",
      "attributeKey": "media_savvy"
    }
  },
  "playerCustomizations": {
    "role": {
      "name": "Role",
      "description": "Choose your role in the Trump administration",
      "options": [
        "Chief of Staff",
        "Press Secretary",
        "National Security Advisor",
        "Family Member/Advisor",
        "Cabinet Secretary"
      ],
      "impact": {
        "Chief of Staff": {
          "crisis_management": 2,
          "patience": 1
        },
        "Press Secretary": {
          "spin": 2,
          "media_savvy": 1
        },
        "National Security Advisor": {
          "crisis_management": 2,
          "cunning": 1
        },
        "Family Member/Advisor": {
          "flattery": 2,
          "cunning": 1
        },
        "Cabinet Secretary": {
          "cunning": 2,
          "spin": 1
        }
      }
    },
    "background": {
      "name": "Background",
      "description": "Choose your pre-White House background",
      "options": [
        "Business Executive",
        "Political Operative",
        "Military Veteran",
        "TV Personality",
        "Campaign Loyalist"
      ],
      "impact": {
        "Business Executive": {
          "flattery": 2,
          "crisis_management": 1
        },
        "Political Operative": {
          "cunning": 2,
          "spin": 1
        },
        "Military Veteran": {
          "patience": 2,
          "crisis_management": 1
        },
        "TV Personality": {
          "media_savvy": 2,
          "spin": 1
        },
        "Campaign Loyalist": {
          "flattery": 2,
          "patience": 1
        }
      }
    }
  },
  "npcs": {
    "administration": [
      {
        "name": "President Trump",
        "description": "Impulsive, media-obsessed, and unpredictable, with a preference for fast food, cable news, and Twitter diplomacy."
      },
      {
        "name": "Chief of Staff",
        "description": "Constantly trying to prevent presidential impulses from becoming international incidents while looking for a dignified exit strategy."
      },
      {
        "name": "Communications Director",
        "description": "Cycled through every 3-6 weeks, permanently exhausted and developing a facial tic from explaining unexplainable tweets."
      },
      {
        "name": "Family Members",
        "description": "Various relatives with ambiguous roles and security clearances, immune to traditional ethics rules and organizational structures."
      }
    ],
    "external": [
      {
        "name": "Press Corps",
        "description": "Constantly bombarded with 'fake news' accusations while trying to keep up with policy reversals that happen mid-press conference."
      },
      {
        "name": "Congressional Leaders",
        "description": "Alternating between public support and private panic, depending on the latest presidential outburst and polling data."
      },
      {
        "name": "Foreign Leaders",
        "description": "Confused diplomats trying to determine if presidential tweets constitute official foreign policy or late-night fast food reactions."
      }
    ]
  }
} 